Revit 2026 API

# ProjectInfoBuildingName Property

---

Get or Set the Building Name of the Project Information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string BuildingName { get; set; }
```
```vb
Public Property BuildingName As String
	Get
	Set
```
```cpp
public:
property String^ BuildingName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member BuildingName : string with get, set
```

#### Property Value

String

This property is used to get or set the Project Number of the Project Information.

#### Reference

ProjectInfo Class

Autodesk.Revit.DB Namespace